Repository: collective/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/index.po
Languages: es

source: **Happy hacking with Plone**
es: **Feliz hacking con Plone**

source: What for?
es: ¿Para qué?

source: Creating a small form able to send an email, or to store some data, generating some extra information about a page and inserting it wherever we want: with Plone these kind of tasks are complex for experts, and almost impossible for beginners.
es: Creación de un pequeño formulario capaz de enviar un correo electrónico, o para almacenar algunos datos, generando alguna información adicional sobre una página y la inserción donde quiera: con Plone este tipo de tareas son complejas para los expertos, y casi imposible para los principiantes.

source: **rapido.plone** allows any developer having a little knowledge of HTML and a little knowledge of Python to implement custom elements and insert them anywhere they want in their Plone site.
es: **rapido.plone** permite a cualquier desarrollador tener un poco de conocimiento de HTML y un poco de conocimiento de Python para implementar elementos personalizados e insertarlos donde quieran en su sitio Plone.

source: How?
es: ¿Cómo?

source: The unique interface to build applications with rapido.plone is the **Plone theming tool**.
es: La interfaz única para crear aplicaciones con rapido.plone es la herramienta **Plone theming**.

source: It implies it can be achieved in the **file system** or through the **inline theming editor**.
es: Implica que se puede lograr en el **sistema de archivos** o mediante el **editor de temas en línea**.

source: A Rapido application is just a part of our current theme; it can be imported, exported, copied, modified, etc. like the rest of the theme.
es: Una aplicación Rapido es sólo una parte de nuestro tema actual; Puede ser importado, exportado, copiado, modificado, etc. como el resto del tema.

source: Moreover, we can use `Diazo <http://docs.diazo.org/en/latest/>`_ extensively to inject our application in the Plone layout easily.
es: Por otra parte, podemos utilizar `Diazo <http://docs.diazo.org/en/latest/>`_ extensivamente para incorporar nuestra aplicación en el diseño de Plone fácilmente.

source: Contents:
es: Contenidos:
