Repository: collective/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/reference.po
Languages: es

source: Access control
es: Control de acceso

source: Access control list
es: Lista de control de acceso

source: The ACL defined in the app applies to records, not to blocks. Blocks are always accessible, if we do not want a block to render some information, we have to implement this in its Python file or use the ``view_permission`` setting.
es: La ACL definida en la aplicación se aplica a registros, no a bloques. Los bloques siempre son accesibles, si no queremos que un bloque proporcione alguna información, tenemos que implementar esto en su archivo Python o usar la configuración ``view_permission``.

source: Moreover, access control only impacts direct HTTP access to records (like opening a record URL, deleting a record via the JSON API, etc.), and it does **not** impact what happens in block Python files.
es: Además, el control de acceso sólo afecta el acceso HTTP directo a los registros (como abrir una dirección URL de registro, eliminar un registro a través de la API de JSON, etc.) y no afecta lo que sucede en los archivos de Python de bloque.

source: For instance in the :doc:`../tutorial`, if an anonymous visitor clicks on the *"Like"* button on a page nobody had voted for yet, the ``like`` function will create a record.
es: Por ejemplo, en el :doc:`../tutorial`, si un visitante anónimo hace clic en el botón *"Like"* de una página en la que nadie había votado todavía, la función ``like`` creará un registro.

source: But an anonymous visitor would not be able to modify this record or to delete it using the JSON API.
es: Pero un visitante anónimo no podría modificar este registro o eliminarlo usando la API de JSON.

source: The expected format is:
es: El formato esperado es:

source: In the list of users or groups, ``'*'`` means everyone.
es: En la lista de usuarios o grupos, ``'*'`` significa todo el mundo.

source: Access levels
es: Niveles de acceso

source: The access levels are:
es: Los niveles de acceso son:

source: ``reader``: can read all the records,
es: ``reader``: puede leer todos los registros,

source: ``author``: can read all the records, can create records, can modify/delete his own records,
es: ``author``: puede leer todos los registros, puede crear registros, puede modificar / borrar sus propios registros,

source: ``editor``: can read/modify/delete any record, can create records.
es: ``editor``: puede leer / modificar / borrar cualquier registro, puede crear registros.

source: The access control settings are managed in the ``settings.yaml`` file in the app root folder.
es: El control de acceso se gestiona en el archivo ``settings.yaml`` de la carpeta raíz de la aplicación.

source: Roles do not grant any specific rights on records, they can be defined freely. They are used in our Python functions to change the app behavior depending on the user.
es: Los roles no otorgan derechos específicos en los registros, pueden definirse libremente. Se utilizan en nuestras funciones de Python para cambiar el comportamiento de la aplicación dependiendo del usuario.

source: For instance, we might have a role named 'PurchaseManager', and in our block we would display a "Validate purchase" button if the current user has the 'PurchaseManager' role.
es: Por ejemplo, podríamos tener un rol llamado 'PurchaseManager', y en nuestro bloque mostraríamos un botón "Validate purchase" si el usuario actual tiene el rol 'PurchaseManager'.

source: Permissions on blocks
es: Permisos sobre bloques

source: By default, blocks are accessible by anyone (including anonymous visitors).
es: De forma predeterminada, los bloques son accesibles por cualquier persona (incluidos los visitantes anónimos).

source: By setting the ``view_permission`` attribute in a block's YAML file, we can control access to this block.
es: Al configurar el atributo ``view_permission`` en el archivo YAML de un bloque, podemos controlar el acceso a este bloque.

source: Its value is a list of users or groups.
es: Su valor es una lista de usuarios o grupos.

source: Example:
es: Ejemplo:

source: This block will be accessible only by the 'PurchaseDepartment' group members and Eric.
es: Este bloque será accesible sólo por los miembros del grupo 'PurchaseDepartment' y Eric.

source: This restriction applies to direct block rendering and element calls, including REST calls.
es: Esta restricción se aplica a la representación directa de bloques y las llamadas de elementos, incluidas las llamadas REST.

source: Application
es: Aplicación

source: A Rapido application is defined by a folder in the ``rapido`` folder in the current theme.
es: Una aplicación Rapido se define por una carpeta en la carpeta ``rapido`` del tema actual.

source: The application folder might contain a ``settings.yaml`` file in its root but that is not mandatory. It allows to define the access control settings (see :doc:`./access`), or to enable the ``debug`` mode.
es: La carpeta de la aplicación puede contener un archivo ``settings.yaml`` en su raíz pero no es obligatorio. Permite definir los ajustes de control de acceso (véase :doc:`./access`) o habilitar el modo ``debug``.

source: It always contains a ``blocks`` folder containing its blocks (see :doc:`./blocks`).
es: Siempre contiene una carpeta de ``blocks`` que contiene sus bloques (consulte :doc:`./blocks`).

source: It might also contain regular theme items (``rules.xml``, CSS, Javascript, etc.).
es: También puede contener elementos regulares de un tema como(archivos ``rules.xml``, CSS, Javascript, etc.).

source: Locating a Rapido application outside the current theme
es: Localización de una aplicación Rapido fuera del tema actual

source: If we use a lot of Rapido applications, or if the theme and the Rapido apps are managed by different persons, it might be preferable to locate the Rapido apps in a dedicated theme.
es: Si utilizamos muchas aplicaciones Rapido, o si el tema y las aplicaciones Rapido son administradas por diferentes personas, puede ser preferible ubicar las aplicaciones Rapido en un tema dedicado.

source: To do so, we just need to reference it using a ``.lnk`` text file in the current theme. The filename should be the app id, and its content must be the theme id.
es: Para ello, solo necesitamos referenciarlo utilizando un archivo de texto plano con extensión ``.lnk`` en el tema actual. El nombre de archivo debe ser el id de la aplicación y su contenido debe ser el ID del tema.

source: For instance, our active theme would be structured like this::
es: Por ejemplo, nuestro tema activo se estructuraría de la siguiente manera::

source: The ``myapp.lnk`` content would be just::
es: El archivo ``myapp.lnk`` sería solo::

source: The ``dev-theme`` theme would contain the full ``myapp`` Rapido app::
es: El tema ``dev-theme`` podría contener la completa aplicación Rapido llamada ``myapp``::

source: And everything will work just like if the ``myapp`` folder was in our active theme.
es: Y todo funcionará como si la carpeta ``myapp`` estuviera en nuestro tema activo.

source: Blocks
es: Bloques

source: A block is defined by 3 files stored in the ``blocks`` folder of the application. Those files have the same filename (which is the block id) with the extensions ``.html``, ``.py`` and ``.yaml``.
es: Un bloque se define mediante 3 archivos almacenados en la carpeta ``blocks`` de la aplicación. Esos archivos tienen el mismo nombre de archivo (que es el identificador de bloque) con las extensiones ``.html``, ``.py`` y ``.yaml``.

source: The HTML file
es: El archivo HTML

source: The ``.html`` file contains the layout of the block. It is regular HTML. Dynamic elements are enclosed in curly brackets. Example:
es: El archivo ``.html`` contiene el diseño del bloque. Es HTML normal. Los elementos dinámicos están encerrados entre corchetes. Ejemplo:

source: The curly brackets will be replaced by the corresponding element value.
es: Los corchetes serán reemplazados por el valor del elemento correspondiente.

source: If the element is a BASIC element and returns an object, we can access its properties. Example:
es: Si el elemento es un elemento BASIC y devuelve un objeto, podemos acceder a sus propiedades. Ejemplo:

source: Similarly, if a BASIC element returns a dictionnary, we can access its items. Example:
es: Del mismo modo, si un elemento BASIC devuelve un diccionario, podemos acceder a sus elementos. Ejemplo:

source: When rendered, the block layout is wrapped in an HTML ``<form>`` element.
es: Cuando se procesa, el diseño del bloque se envuelve en un elemento HTML ``<form>``.

source: The layout can contain Mockup patterns markup, they will be rendered as expected.
es: El diseño puede contener el marcado de patrones de Mockup, se renderizará como se esperaba.

source: Some Mockup patterns might need to render actual curly brackets in the output. Double them to escape them:
es: Es posible que algunos patrones de Mockup tengan que representar los corchetes reales en la salida. Doble ellos para escapar de ellos:

source: Once rendered, if the block contains some links with an ``ajax`` target:
es: Una vez procesado, si el bloque contiene algunos enlaces con un destino ``ajax``:

source: the request will be loaded in AJAX mode and its content will replace the current block content.
es: la solicitud se cargará en modo AJAX y su contenido reemplazará el contenido del bloque actual.

source: TAL template
es: Plantilla TAL

source: The HTML template only offers element insertion. If we need more templating features, the ``.html`` file can be replaced by a ``.pt`` file, and we can use the `TAL commands <http://www.owlfish.com/software/simpleTAL/tal-guide.html>`_.
es: La plantilla HTML sólo ofrece la inserción de elementos. Si necesitamos más características de plantilla, el archivo ``.html`` puede ser reemplazado por un archivo ``.pt``, y podemos usar los `comandos TAL <http://www.owlfish.com/software/simpleTAL/tal-guide.html>`_.

source: In the context of a Page Template, the block elements are available in the ``elements`` object:
es: En el contexto de una Page Template, los elementos de bloque están disponibles en el objeto ``elements``:

source: Elements can be used as conditions:
es: Los elementos se pueden utilizar como condiciones:

source: If an element returns an iterable object (list, dictionary), we can make a loop:
es: Si un elemento devuelve un objeto iterable (lista, diccionario), podemos hacer un bucle:

source: The current Rapido context is available in the ``context`` object:
es: El contexto Rapido actual está disponible en el objeto ``context``:

source: The YAML file
es: El archivo YAML

source: The ``.yaml`` file contains: - the elements settings (see below),
es: El archivo ``.yaml`` contiene: - los configuraciones de elementos (ver más abajo),

source: the ``target`` option: if set to ``ajax``, any action in the block resulting in a form submission will not redirect the current page, it will just refresh the block content through an AJAX call,
es: la opción ``target``: si se establece en ``ajax``, cualquier acción en el bloque que resulte en un envío de formulario no redirigirá la página actual, solo actualizará el contenido del bloque a través de una llamada AJAX,

source: the ``view_permission`` to manage who can see the block (see :doc:`./access`).
es: la ``view_permission`` para quién puede ver el bloque (consulte :doc:`./access`).

source: The Python file
es: El archivo Python

source: The ``.py`` file contains the implementation of each element as a Python function which name is the element id, and taking ``context`` as parameter.
es: El archivo ``.py`` contiene la implementación de cada elemento como una función de Python cuyo nombre es el identificador de elemento y toma ``context`` como parámetro.

source: Content rules
es: Reglas de Contenido

source: Content rules allows to trigger specific actions (for instance, send an email) when an given event (for instance, when new content is created in such and such a folder) happens in our Plone site.
es: Las reglas de contenido permiten activar acciones específicas (por ejemplo, enviar un mensaje de correo electrónico) cuando un evento determinado (por ejemplo, cuando se crea un nuevo contenido en tal y cual carpeta) que ocurra en nuestro sitio Plone.

source: Rapido provides a content rule action, so we can execute a Rapido function when an given event happens.
es: Rapido proporciona una acción de regla de contenido, por lo que podemos ejecutar una función Rapido cuando sucede un evento dado.

source: The action to take is defined in the Plone content rules editor (see the `Plone content rules documentation <http://docs.plone.org/working-with-content/managing-content/contentrules.html>`_), and requires the following parameters:
es: La acción a tomar se define en el editor de reglas de contenido de Plone (consulte la `documentación de las reglas de contenido de Plone <http://docs.plone.org/working-with-content/managing-content/contentrules.html>`_), y requiere los siguientes parámetros:

source: the app id,
es: el id de la aplicación,

source: the block id,
es: el identificador de bloque,

source: the function name.
es: el nombre de la función.

source: The ``context.content`` received by the function will be the content where the event happened.
es: El ``context.content`` recibido por la función será el contenido donde ocurrió el evento.

source: Displaying Rapido in Plone
es: Mostrando Rapido en Plone

source: We can see a block by visiting its URL:
es: Podemos ver un bloque visitando su dirección URL:

source: Similarly for a record:
es: Del mismo modo para un registro:

source: But it just returns the HTML generated by the block.
es: Pero simplemente devuelve el HTML generado por el bloque.

source: To show our blocks in our Plone site, there are 4 possibilities:
es: Para mostrar nuestros bloques en nuestro sitio de Plone, hay 4 posibilidades:

source: Diazo rules
es: Reglas diazo

source: We can use the `Diazo <http://docs.diazo.org/en/latest/>`_ ``include`` directive to get the Rapido block content and inject it in our pages with ``before``, ``after`` or ``replace`` directives.
es: Podemos utilizar la directiva `Diazo <http://docs.diazo.org/en/latest/>`_ ``include`` para obtener el contenido del bloque Rapido e inyectarlo en nuestras páginas con las directivas ``before``, ``after`` o ``replace``.

source: Extra views
es: Vistas extra

source: Since rapido.plone 1.1, we can declare first-class Plone views from Rapido, but it requires plone.resources 1.2.
es: Desde rapido.plone 1.1, podemos declarar vistas de primera clase de Plone desde Rapido, pero requiere plone.resources 1.2.

source: If we do not want to just inject a small piece of HTML in existing pages, but use a Rapido block as the main part of the page, we can declare a block as a view in its YAML file:
es: Si no queremos simplemente inyectar un pequeño fragmento de HTML en las páginas existentes, sino usar un bloque Rapido como parte principal de la página, podemos declarar un bloque como una vista en su archivo YAML:

source: And then we call ``@@my-custom-view`` on any content, like:
es: Y luego llamamos a ``@@my-custom-view`` en cualquier contenido, como:

source: and it displays our block as main page content.
es: y muestra nuestro bloque como contenido de la página principal.

source: If the ``with_theme`` property is ``false``, the page is rendered without the Plone theme (we just get the block by itself).
es: Si la ``with_theme`` es ``false``, la página se procesa sin el tema Plone (solo obtenemos el bloque por sí mismo).

source: Extra views before 1.1
es: Vistas extra antes de 1.1

source: **DEPRECATED since rapido.plone 1.1**
es: **DESCONTINUADA desde rapido.plone 1.1**

source: If we do not want to just inject a small piece of HTML in existing pages, but create a new view for our contents, we can use the Rapido **neutral views**.
es: Si no queremos simplemente inyectar un pequeño fragmento de HTML en las páginas existentes, sino crear una nueva vista para nuestros contenidos, podemos usar las **vistas neutras** de Rapido.

source: Neutral views are obtained by adding ``@@rapido/view/<any-name>`` to a content URL. It will just return the content's default view (that is why we call them neutral).
es: Las vistas neutrales se obtienen agregando ``@@rapido/view/<any-name>`` a una dirección URL de contenido. Simplemente devolverá la vista predeterminada del contenido (por eso los llamamos neutrales).

source: For instance, all those URLs display the same thing::
es: Por ejemplo, todas esas direcciones URL muestran lo mismo:

source: So we are able to call a content with a URL we control, and that allows us to create specific Diazo rules for it using the ``if-path`` attribute.
es: Así que podemos llamar a un contenido con una URL que controlamos, y eso nos permite crear reglas específicas de Diazo para ello usando el atributo ``if-path``.

source: **Hard-coded injection**
es: **Inyección codificada**

source: In this example, if we open:
es: En este ejemplo, si abrimos la siguiente dirección URL:

source: we will see our page main content replaced with our ``report`` block.
es: veremos el contenido principal de nuestra página es reemplazado por nuestro bloque de ``report``.

source: **Dynamic injection**
es: **Inyección dinámica**

source: We can also dynamically display a Rapido resource specified in the URL. Rapido provides an URL injection pattern which allows to refer to the parent request in our Diazo rule.
es: También podemos mostrar dinámicamente un recurso Rapido especificado en la URL. Rapido proporciona un patrón de inyección de URL que permite referirse a la solicitud de los padres en nuestra regla Diazo.

source: The pattern is: ``$<integer>``, where the integer specifies the starting position after ``@@rapido`` to get the path to inject.
es: El patrón es: ``$<integer>``, donde el entero especifica la posición inicial después de ``@@rapido`` para obtener la ruta de inyección.

source: For instance:
es: Por ejemplo:

source: with ``http://localhost:8080/Plone/@@rapido/view/show-report/5654654``, ``$3`` gets the part of the path starting at the 3rd element after ``@@rapido``, which is: ``5654654``,
es: con ``http://localhost:8080/Plone/@@rapido/view/show-report/5654654``, ``$3`` recibe la parte de la ruta a partir del tercer elemento después de ``@@rapido``, el cual es: ``5654654``,

source: with ``http://localhost:8080/Plone/@@rapido/view/show-report/myapp/record/5654654``, ``$3`` gets the part of the path starting at the 3rd element after ``@@rapido``, which is: ``myapp/record/5654654``,
es: con ``http://localhost:8080/Plone/@@rapido/view/show-report/myapp/record/5654654``, ``$3`` recibe la parte de la ruta que comienza en el tercer elemento después de ``@@rapido``, el cual es: ``myapp/record/5654654``,

source: with ``http://localhost:8080/Plone/@@rapido/view/show-report/myapp/record/5654654/edit``, ``$5`` gets the part of the path starting at the 5th element after ``@@rapido``, which is: ``5654654/edit``.
es: con ``http://localhost:8080/Plone/@@rapido/view/show-report/myapp/record/5654654/edit``, ``$5`` obtiene la parte de la ruta que comienza en el quinto elemento después de ``@@rapido``, el cual es: ``5654654/edit``.

source: Examples:
es: Ejemplos:

source: if we open:
es: si abrimos la siguiente dirección URL:

source: we will render ``myapp/record/my-record-id`` in our page main content.
es: nos representaría ``myapp/record/my-record-id`` en nuestro de la página principal de contenido.

source: We could also do:
es: También podríamos hacer:

source: we will get the very same rendering as in our previous example.
es: obtendremos la misma representación que en nuestro ejemplo anterior.

source: `Mosaic <http://plone-app-mosaic.s3-website-us-east-1.amazonaws.com/latest/>`_ is a layout editor.
es: `Mosaic <http://plone-app-mosaic.s3-website-us-east-1.amazonaws.com/latest/>`_ es un editor de diseño.

source: It allows to add and manipulate *tiles* in our content layouts.
es: Permite agregar y manipular *tiles* en nuestros diseños de contenido.

source: Rapido provides a Mosaic tile, so any Rapido block can be added as a tile to our layouts.
es: Rapido proporciona un tile de mosaico, así que cualquier bloque de Rapido se puede agregar como tile a nuestras disposiciones del diseño.

source: To enable it, we need to install Mosaic and then to import a specific Rapido Generic Setup profile named "rapido.plone mosaic tile".
es: Para habilitarlo, necesitamos instalar Mosaic y luego importar un perfil específico de Rapido Generic Setup llamado "rapido.plone mosaic tile".

source: Mockup patterns
es: Patrones Mockup

source: Some Mockup patterns can display contents provided by an URL. The two main use cases are:
es: Algunos patrones de Mockup pueden mostrar contenido proporcionado por una URL. Los dos principales casos de uso son:

source: **Display a Rapido block in a modal**: we use the ``plone-modal`` pattern on a ``<a>`` element, the Rapido block URL will be provided in its ``href`` attribute, and we just need to specify ``form.rapido-block`` as content selector (because ``plone-modal`` default content selector is ``#content``, which is accurate for a Plone page but not for a Rapido block). Example:
es: **Mostrar un bloque Rapido en un modal**: usamos el patrón ``plone-modal`` en un elemento ``<a>``, la URL del bloque Rapido será proporcionada en su atributo ``href``, y solo necesitamos especificar ``form.rapido-block`` como selector de contenido (porque ``plone-modal`` el selector de contenido por defecto es ``#content``, el cual es preciso para una página de Plone pero no para un bloque de Rapido). Ejemplo:

source: We create a block named ``my-content`` containing whatever we might need, and we create a block named ``menu`` containing the following HTML:
es: Creamos un bloque llamado ``my-content`` contiene lo que sea necesario, y creamos un bloque llamado ``menu`` contiene el siguiente HTML:

source: And then we just need to insert ``menu`` in our Plone page (using a Diazo rule).
es: Y entonces solo necesitamos insertar ``menu`` en nuestra página de Plone (usando una regla de Diazo).

source: See `Mockup modal documentation <http://plone.github.io/mockup/dev/#pattern/modal>`_ for more details about the options.
es: Consulte la `documentación modal de Mockup <http://plone.github.io/mockup/dev/#pattern/modal>`_ para obtener más detalles sobre las opciones.

source: **Load a Rapido block dynamically in the current page**: we use the ``plone-contentloader`` to inject our Rapido block wherever we want. In our previous example, we would change the ``menu`` HTML to:
es: **Cargar un bloque Rapido dinámicamente en la página actual**: usamos el ``plone-contentloader`` para inyectar nuestro bloque Rapido donde queramos. En nuestro ejemplo anterior, cambiaríamos el ``menu`` HTML a:

source: It would replace the "Load content" link with our ``my-content`` block when we click on the link.
es: Reemplazaría el enlace "Cargar contenido" con nuestro bloque ``my-content`` cuando haga clic en el enlace.

source: with ``plone-contentloader``, the content selector is passed directly as an hash at the end of the URL.
es: con ``plone-contentloader``, el selector de contenido se pasa directamente como un hash al final de la URL.

source: ``plone-contentloader`` also allows us to target a specific element for the injection (instead of replacing the link):
es: ``plone-contentloader`` también nos permite orientar un elemento específico para la inyección (en lugar de reemplazar el enlace):
