Repository: collective/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/reference.po
Languages: es

source: By default, the injection is triggered by a click, but we can choose any DOM event (``mouseover`` for instance), and we can even perform the injection immediately (using the ``immediate`` trigger):
es: De forma predeterminada, la inyección se activa con un clic, pero podemos elegir cualquier evento de DOM (``mouseover`` por ejemplo), e incluso podemos realizar la inyección inmediatamente (usando el trigger ``immediate``):

source: Elements
es: Elementos

source: Declaration
es: Declaración

source: Elements must be declared in the YAML file under the ``elements`` entry. Every element is declared by its identifier, and its definition is:
es: Los elementos se deben declarar en el archivo YAML bajo la entrada de ``elements``. Cada elemento es declarado por su identificador, y su definición es:

source: either a list of parameters, e.g.:
es: una lista de parámetros, por ejemplo:

source: or just a string, in which case Rapido will assume it is the ``type`` parameter, e.g.:
es: o simplemente una cadena, en cuyo caso Rapido asumirá que es el parámetro ``type``, por ejemplo:

source: is equivalent to:
es: es equivalente a:

source: Types
es: Tipos

source: There are different types of elements (defined by the ``type`` parameter):
es: Hay diferentes tipos de elementos (definidos por el parámetro ``type``):

source: ``BASIC``: a piece of HTML returned by its implementation function.
es: ``BASIC``: una pieza de HTML devuelta por su función de implementación.

source: ``ACTION``: a button that will execute the implementation function when clicked. Its label is provided by the ``label`` parameter.
es: ``ACTION``: un botón que ejecutará la función de implementación al hacer clic. Su etiqueta viene dada por el parámetro ``label``.

source: ``TEXT``: a text input field.
es: ``TEXT``: un campo de entrada de texto.

source: ``NUMBER``: a number input field.
es: ``NUMBER``: un campo de entrada numérico.

source: ``DATETIME``: a date/time input field.
es: ``DATETIME``: un campo de entrada de fecha / hora.

source: Input elements
es: Elementos de entrada

source: Input elements (i.e. ``TEXT``, ``NUMBER``, or ``DATETIME``) can be indexed as ``field`` or ``text``. Indexing is indicated using the ``index_type`` parameter.
es: Los elementos de entrada (es decir, ``TEXT``, ``NUMBER``, o ``DATETIME``) se pueden indexar como ``field`` o ``text``. La indexación se indica utilizando el parámetro ``index_type``.

source: By default, input elements are editable but they might also have a different ``mode``:
es: De forma predeterminada, los elementos de entrada son editables pero también pueden tener un ``mode`` diferente:

source: ``COMPUTED_ON_SAVE``: the value is computed every time the record is saved,
es: ``COMPUTED_ON_SAVE``: el valor se calcula cada vez que se guarda el registro,

source: ``COMPUTED_ON_CREATION``: the value is computed when the record is created.
es: ``COMPUTED_ON_CREATION``: el valor se calcula cuando se crea el registro.

source: Action elements
es: Elementos de acción

source: Action elements are rendered as submit buttons and allow to trigger a call to an associated Python function.
es: Los elementos de acción se representan como botones de envío y permiten activar una llamada a una función asociada de Python.

source: If the function returns a value, it must be a string, and it will be used as a redirection URL for the current request.
es: Si la función devuelve un valor, debe ser una cadena y se utilizará como dirección URL de redirección para la solicitud actual.

source: This is the way to redirect to another location once the action has been executed.
es: Esta es la forma de redirigir a otra ubicación una vez que se ha ejecutado la acción.

source: Builtin actions
es: Acciones adicionales

source: The following actions can be included in our block HTML layout, and do not require an associated Python function:
es: Las siguientes acciones se pueden incluir en nuestro diseño HTML de bloque y no requieren una función asociada de Python:

source: ``_save``: creates a record based on the field elements' submitted values, and then redirects to the record display in read mode;
es: ``_save``: crea un registro basado en los valores enviados de los elementos de campo y luego redirige a la visualización de registros en modo de lectura;

source: ``_edit``: opens the current record in edit mode;
es: ``_edit``: abre el registro actual en modo de edición;

source: ``_delete``: deletes the current record.
es: ``_delete``: elimina el registro actual.

source: Direct HTTP call to elements
es: Llamada HTTP directa a elementos

source: We usually want to display blocks, but we can also call an element by its URL:
es: Normalmente queremos mostrar bloques, pero también podemos llamar a un elemento por su dirección URL:

source: Both GET and POST requests are supported.
es: Se admiten las solicitudes GET y POST.

source: If the element is an action, its Python function will be executed; the returned value is supposed to be a string and will be used as a redirection URL. When building an application, it allows us to create links that will redirect the user to the proper location depending on our business criteria (e.g. if the user belongs to group A, go to ``page1``, else go to ``page2``).
es: Si el elemento es una acción, se ejecutará su función Python; El valor devuelto se supone que es una cadena y se utilizará como una dirección URL de redirección. Al construir una aplicación, nos permite crear enlaces que redirigirán al usuario a la ubicación correcta dependiendo de nuestros criterios de negocio (por ejemplo, si el usuario pertenece al grupo A, vaya a la ``page1``, o bien vaya a la página ``page2``).

source: If the element is not an action, its Python function will be executed, and the result is returned as a response.
es: Si el elemento no es una acción, su función Python se ejecutará y el resultado se devolverá como una respuesta.

source: We can change the response content type like this:
es: Podemos cambiar el tipo de contenido de respuesta como este:

source: External call to Rapido
es: Llamada externa a Rapido

source: By traversing to ``@@rapido-call``, we can call a Rapido element as a Python function.
es: Al recorrer a ``@@rapido-call``, podemos llamar a un elemento Rapido como una función Python.

source: It might be very useful when we want to use Rapido from a PythonScript, a Plone page template, or any Plone mechanism offering to run a small script (Plone workflow, ``collective.easyform``, etc.).
es: Podría ser muy útil cuando queramos usar Rapido desde un PythonScript, una page template de Plone o cualquier mecanismo Plone que ofrezca ejecutar un pequeño script (flujo de trabajo Plone, ``collective.easyform``, etc.).

source: ``@@rapido-call`` accepts the following parameters:
es: ``@@rapido-call`` acepta los siguientes parámetros:

source: ``path`` (mandatory, string): Rapido path to the element to call (format: ``app/blocks/element``),
es: ``path`` (obligatorio, cadena): Rapido ruta al elemento a llamar (formato: ``app/blocks/element``),

source: ``content`` (optional, object): the content to provide to the Rapido context,
es: ``content`` (opcional, objeto): el contenido a proporcionar al contexto de Rapido,

source: any other named parameters: those named parameters will be available to the Python implementation of the element in the ``context.params`` dictionary.
es: cualquier otro parámetro nombrado: los parámetros nombrados estarán disponibles para la implementación de Python del elemento en el diccionario ``context.params``.

source: Rapido element in ``myapp/stats.py``:
es: Elemento Rapido en ``myapp/stats.py``:

source: Reference
es: Referencia

source: Indexing and searching
es: Indexación y búsqueda

source: The Rapido storage system (`souper <https://github.com/bluedynamics/souper>`_) supports indexing.
es: El sistema de almacenamiento Rapido (`souper <https://github.com/bluedynamics/souper>`_) soporta la indexación.

source: Any block element can be indexed by adding a ``index_type`` setting in its YAML definition.
es: Cualquier elemento de bloque se puede indexar agregando una configuración ``index_type`` en su definición YAML.

source: The ``index_type`` setting can have two possible values:
es: El ajuste ``index_type`` puede tener dos valores posibles:

source: ``field``: such indexes match exact values, and support comparison queries, range queries, and sorting.
es: ``field``: estos índices coinciden con los valores exactos y admiten consultas de comparación, consultas de rangos y clasificación.

source: ``text``: such index matches contained words (applicable for text values only).
es: ``text``: dicho índice corresponde a palabras contenidas (aplicable sólo a valores de texto).

source: Queries use the (`CQE format <http://docs.repoze.org/catalog/usage.html#query-objects>`_.
es: Las consultas utilizan el formato (`CQE format <http://docs.repoze.org/catalog/usage.html#query-objects>`_).

source: Example (assuming ``author``, ``title`` and ``price`` are existing indexes):
es: Ejemplo (asumiendo que el ``author``, ``title`` y ``price`` son índices existentes):

source: Records are indexed at the time they are saved. We can force reindexing using the Python API:
es: Los registros se indexan en el momento en que se guardan. Podemos forzar la reindexión mediante la API de Python:

source: We can also reindex all the records using the ``refresh`` URL command:
es: También podemos reindexar todos los registros usando el comando URL ``refresh``:

source: or using the REST API (see :doc:`../rest`).
es: o usando la API REST (ver :doc:`../rest`).

source: We can add Javascript files to our theme that will interact with our Rapido blocks.
es: Podemos agregar archivos Javascript a nuestro tema que interactuará con nuestros bloques Rapido.

source: There are no specific constraints on these scripts. Nevertheless, it might be handy to use the Javascript dependencies already provided by Plone, such as ``jQuery`` and ``require``.
es: No hay restricciones específicas en estos scripts. Sin embargo, podría ser útil utilizar las dependencias Javascript ya proporcionadas por Plone, como ``jQuery`` y ``require``.

source: As Rapido allows to load block content dynamically (using the ``ajax`` mode), we might need to know when a Rapido block has been loaded dynamically.
es: Como Rapido permite cargar dinámicamente el contenido del bloque (usando el modo ``ajax``), es posible que tengamos que saber cuándo se ha cargado dinámicamente un bloque Rapido.

source: To do that we can use the ``rapidoLoad`` event, which receives the block id as parameter. Example:
es: Para ello podemos usar el evento ``rapidoLoad``, que recibe el identificador de bloque como parámetro. Ejemplo:

source: Associated Python functions
es: Funciones asociadas de Python

source: For a ``BASIC`` element, the associated Python function (having the same id) will return the content of the element.
es: Para un elemento ``BASIC``, la función Python asociada (que tiene el mismo id) devolverá el contenido del elemento.

source: For field elements (``TEXT``, ``NUMBER``, ``DATETIME``), the associated Python function will return its default value.
es: Para los elementos de campo (``TEXT``, ``NUMBER``, ``DATETIME``), la función Python asociada devolverá su valor predeterminado.

source: For an ``ACTION`` element, the associated Python function will be executed when the action is triggered.
es: Para un elemento ``ACTION``, la función Python asociada se ejecutará cuando se active la acción.

source: Special Python functions
es: Funciones especiales de Python

source: Executed when a record is saved with the block. If it returns a value, it must be a string, and it will be used as a redirection URL for the current request.
es: Se ejecuta cuando se guarda un registro con el bloque. Si devuelve un valor, debe ser una cadena y se utilizará como dirección URL de redirección para la solicitud actual.

source: Executed when a block is displayed. It will be executed before all the element functions. It can be used to do some computation and put the result in the ``context`` so it can be accessed by the different elements. It can also be used to redirect to another page (using ``context.request.response.redirect()``).
es: Se ejecuta cuando se muestra un bloque. Se ejecutará antes de todas las funciones del elemento. Se puede utilizar para hacer algún cálculo y poner el resultado en el ``context`` para que pueda ser accedido por los diferentes elementos. También se puede usar para redireccionar a otra página (usando ``context.request.response.redirect()``).

source: Executed when a record is deleted. If it returns a value, it must be a string, and it will be used as a redirection URL for the current request.
es: Se ejecuta cuando se elimina un registro. Si devuelve un valor, debe ser una cadena y se utilizará como dirección URL de redirección para la solicitud actual.

source: Executed at creation time to compute the record id.
es: Se ejecuta en el momento de la creación para calcular el id del registro.

source: Records
es: Registros

source: Rapido records can be created by saving a block containing field elements. The value of each submitted element will be stored in a corresponding item.
es: Los registros Rapido se pueden crear guardando un bloque que contiene elementos de campo. El valor de cada elemento enviado se almacenará en un elemento correspondiente.

source: In that case, the record has an associated block (the block id is stored in an item named ``block``). When the record is rendered for display (when we load its URL in our browser), it uses the layout of the named block.
es: En ese caso, el registro tiene un bloque asociado (el identificador de bloque se almacena en un elemento llamado ``block``). Cuando el registro se representa para su visualización (cuando cargamos su dirección URL en nuestro navegador), utiliza el diseño del bloque con nombre.

source: Records can also be created manually (without any associated block) using the Python API or the REST API. Such records cannot be rendered automatically by calling their URL, but their item values can be used in a block if we know how to find the record (in the :doc:`../tutorial` for instance, our records are created manually from the ``like`` function, they are not associated with the ``rate`` block, but we use the stored items to produce our element contents).
es: Los registros también se pueden crear manualmente (sin ningún bloque asociado) utilizando la API de Python o la API REST. Tales registros no se pueden renderizar automáticamente llamando a su dirección URL, pero sus valores de elemento se pueden usar en un bloque si sabemos cómo encontrar el registro (en el :doc:`../tutorial` por ejemplo, nuestros registros se crean manualmente a partir de la función ``like``, no están asociados Con el bloque de ``rate``, pero usamos los elementos almacenados para producir nuestros contenidos de elementos).

source: Import/export and source management
es: Importar / exportar y gestión de código fuente

source: Rapido applications are implemented in the `/rapido` folder of a Diazo theme. All the known development procedures for theming apply to Rapido development.
es: Las aplicaciones Rapido se implementan en la carpeta `/rapido` de un tema Diazo. Todos los procedimientos de desarrollo conocidos para el tema se aplican al desarrollo Rapido.

source: ZIP import/export
es: Importar / exportar ZIP

source: The Plone theming editor allows to export a Diazo theme as a ZIP file, or to import a new theme from a ZIP file.
es: El editor de temas de Plone permite exportar un tema Diazo como un archivo ZIP o importar un nuevo tema desde un archivo ZIP.

source: That is the way we will import/export our Rapido applications between our sites.
es: Esa es la forma en que vamos a importar / exportar nuestras aplicaciones Rapido entre nuestros sitios.

source: Direct source editing
es: Edición de código fuente directamente

source: We might also store our Diazo themes on our server in the Plone installation folder::
es: También podríamos almacenar nuestros temas Diazo en nuestro servidor en la carpeta de instalación de Plone::

source: That way, we can develop our Rapido applications using our usual development tools (text editor or IDE, Git, etc.).
es: De esta manera, podemos desarrollar nuestras aplicaciones Rapido utilizando nuestras herramientas habituales de desarrollo (editor de texto o IDE, Git, etc.).

source: Plone add-on
es: Complemento de Plone

source: We can also create our own Plone add-on (see `Plone documentation <http://docs.plone.org/develop/addons/index.html>`_, and `Plone training <http://training.plone.org/5/theming/theme-package.html>`_) and manage our Rapido applications in its theme folder.
es: También podemos crear nuestro propio complemento de Plone (consulte la `documentación de Plone <http://docs.plone.org/develop/addons/index.html>`_, y `formación de Plone <http://training.plone.org/5/theming/theme-package.html>`_) y gestionar nuestras aplicaciones de Rapido en su carpeta de temas.
