Repository: collective/rapido.plone
Catalog: docs/_locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: How to build a content rating system in Plone in few minutes.
es: Como construir un sistema de calificaciones de contenidos en Plone en tan solo unos minutos.

source: Objective
es: Objectivo

source: We want to offer to our visitors the ability to click on a *"Like"* button on any Plone content, and the total of votes must be displayed next to the button.
es: Queremos ofrecer a nuestros visitantes la posibilidad de hacer clic en un botón *"Me gusta"* en cualquier contenido de Plone, y el total de votos debe mostrarse junto al botón.

source: There is a screencast covering the `first steps of the Rapido tutorial <https://www.youtube.com/watch?v=a7B-lX0caW0>`_.
es: Hay un screencast que cubre los `primeros pasos del tutorial de Rapido <https://www.youtube.com/watch?v=a7B-lX0caW0>`_.

source: Prerequisites
es: Requisitos previos

source: Run buildout to deploy Rapido and its dependencies (see :doc:`./installation`).
es: Ejecute buildout para implementar Rapido y sus dependencias (consulte :doc:`./installation`).

source: Install the ``rapido.plone`` add-on from Plone site setup.
es: Instale el complemento ``rapido.plone`` desde la Configuración del sitio de Plone.

source: Initializing the Rapido app
es: Inicializando la aplicación Rapido

source: We go to Plone *Site setup*, and then *Theming*.
es: Vamos a la *Configuración del sitio* de Plone, y luego *Temas*.

source: If our current active theme is not editable inline through the Plone web interface (i.e. there is no *"Modify theme"* button), we will first need to create an editable copy:
es: Si nuestro tema activo actual no es editable en línea a través de la interfaz web de Plone (es decir, no hay botón *"Modificar tema"*), primero deberemos crear una copia editable del mismo:

source: click on *"Copy"*,
es: haga clic en *"Copiar"*,

source: enter a name, for example *"tutorial"*.
es: introduzca un nombre, por ejemplo *"tutorial"*.

source: check *"Immediately enable new theme"*.
es: marque la casilla *"Inmediatamente habilitar nuevo tema"*.

source: Else, we just click on the *"Modify theme"* button.
es: De lo contrario, simplemente haga clic en el botón *"Modificar tema"*.

source: We can see our theme structure, containing CSS files, images, HTML, and Diazo rules.
es: Podemos ver nuestra estructura de tema, que contiene archivos CSS, imágenes, HTML y reglas de Diazo.

source: To initialize our Rapido app named "rating", we need to:
es: Para inicializar nuestra aplicación Rapido llamada "rating", necesitamos:

source: create a folder named ``rapido`` in the theme root,
es: crear una carpeta llamada ``rapido`` en la raíz del tema,

source: in this ``rapido`` folder, create a folder named ``rating``.
es: en esta carpeta ``rapido``, cree una carpeta llamada ``rating``.

source: The application is now ready.
es: La aplicación ya está lista.

source: Creating the "Like" button
es: Creación del botón "Me gusta"

source: Rapido apps are composed of **blocks**. Let's create a block that will render our button:
es: Las aplicaciones de Rapido están compuestas de **bloques**. Vamos a crear un bloque que hará que nuestro botón:

source: go to the ``rating`` folder and create a new folder named ``blocks``,
es: vaya a la carpeta ``rating`` y cree una nueva carpeta denominada ``blocks``,

source: in this ``blocks`` folder, let's create a new block named ``rate``. To do this, we need to create 3 files:
es: en esta carpeta de ``blocks``, vamos a crear un nuevo bloque llamado ``rate``. Para ello, necesitamos crear 3 archivos:

source: The ``rate.html`` file:
es: El archivo ``rate.html``:

source: This allows us to implement the block layout. It is a regular HTML file, but it may contain Rapido **elements**, enclosed in brackets. In our case, we have one element, namely ``{like}``, in charge of rendering the *"Like"* button.
es: Esto nos permite implementar el diseño del bloque. Es un archivo HTML normal, pero puede contener **elementos** Rapido, entre paréntesis. En nuestro caso, tenemos un elemento, a saber ``{like}``, encargado de representar el botón *"Like"*.

source: The ``rate.py`` file
es: El archivo ``rate.py``

source: It provides the element's implementation. Each element in the block has a corresponding Python function having the same id. In our case, that is the code that will be executed when a user clicks on *"Like"*. Right now, it does nothing, but we will change it later.
es: Proporciona la implementación del elemento. Cada elemento del bloque tiene una función Python correspondiente que tiene el mismo id. En nuestro caso, ese es el código que se ejecutará cuando un usuario haga clic en "Like". En este momento, no hace nada, pero lo cambiaremos más tarde.

source: The ``rate.yaml`` file:
es: El archivo ``rate.yaml``:

source: This file contains all the needed settings for our block. Here we declare that our block contains one element named ``like``, which is an **action** (i.e. it will be rendered as a button), and its displayed label is *"Like"*.
es: Este archivo contiene todos los ajustes necesarios para nuestro bloque. Aquí declaramos que nuestro bloque contiene un elemento denominado ``like``, que es una **acción** (es decir, se renderizará como un botón), y su etiqueta mostrada es *"Like"*.

source: Now that our block is ready, we can see it using the following URL:
es: Ahora que nuestro bloque está listo, podemos verlo usando la siguiente dirección URL:

source: The next step is to embed our block in our Plone pages.
es: El siguiente paso es incrustar nuestro bloque en nuestras páginas de Plone.

source: Inserting the block in Plone pages
es: Insertar el bloque en páginas Plone

source: To include our block somewhere in Plone, we will use a Diazo rule. Let's open our ``rules.xml`` file in the root of our theme, and add the following lines:
es: Para incluir nuestro bloque en algún lugar de Plone, usaremos una regla de Diazo. Abramos nuestro archivo ``rules.xml`` en la raíz de nuestro tema y agregue las siguientes líneas:

source: The ``include`` directive allows us to retrieve a piece of content; in our case, the HTML form produced by our block. And the ``after`` directive inserts it after the main title in our page.
es: La directiva ``include`` nos permite recuperar una parte del contenido; En nuestro caso, la forma HTML producida por nuestro bloque. Y la directiva ``after`` inserta después del título principal en nuestra página.

source: So, now if we visit any page of our Plone site, we see our block displayed just under the title.
es: Por lo tanto, ahora si visitamos cualquier página de nuestro sitio de Plone, vemos nuestro bloque mostrado justo debajo del título.

source: That is nice, but there is a small problem: when we click on the *"Like"* button, we are redirected to the raw block content, and we lose our current Plone page.
es: Eso es bueno, pero hay un pequeño problema: cuando hacemos clic en el botón "Like", estamos redirigidos al contenido bruto del bloque, y perdemos nuestra página actual de Plone.

source: Let's fix that.
es: Vamos a arreglar eso.

source: Staying in our Plone page
es: Estando en nuestra página Plone

source: If we want to stay on our current page after submitting our block, we need to enable **AJAX** mode.
es: Si queremos permanecer en nuestra página actual después de enviar nuestro bloque, necesitamos habilitar el modo **AJAX**.

source: To do this, let's change our ``rate.yaml`` file like this:
es: Para hacer esto, debe cambiar nuestro archivo ``rate.yaml`` así:

source: Now, if we click on the *"Like"* button, the block is just reloaded dynamically, and we stay in our current page.
es: Ahora, si hacemos clic en el botón *"Like"*, el bloque se vuelve a cargar dinámicamente y nos quedamos en nuestra página actual.

source: Counting the votes
es: Contando los votos

source: Let's go back to ``rate.py``, and focus on the ``like`` function implementation.
es: Volvamos al archivo ``rate.py``, y nos enfocamos en la implementación de la función ``like``.

source: When a user clicks on the *"Like"* button, we need to get the current content the user voted for, check how many votes it already has, and add one new vote.
es: Cuando un usuario hace clic en el botón *"Like"*, necesitamos obtener el contenido actual que el usuario votó, comprobar cuántos votos ya tiene y agregar un nuevo voto.

source: Rapido allows to create **records**, so we will create a record for each content item, and we will use the content path as an id.
es: Rapido permite crear **registros**, por lo que crearemos un registro para cada elemento de contenido, y usaremos la ruta del contenido como un id.

source: So let's replace our current implementation with:
es: Así que reemplacemos nuestra implementación actual por:

source: ``context.content`` returns the current Plone content, and ``absolute_url_path`` is a Plone method returning the path of a Plone object.
es: ``context.content`` devuelve el actual contenido de Plone y ``absolute_url_path`` es un método Plone que devuelve la ruta de un objeto Plone.

source: ``context.app`` allows to access to the current Rapido app, so we can easily use the Rapido API, like ``create_record`` or ``get_record``.
es: ``context.app`` permite acceder a la actual aplicación Rapido, por lo que podemos fácilmente utilizar la API de Rapido, como ``create_record`` o ``get_record``.

source: A Rapido record contains **items**. The ``get(item, default=none)`` method returns the value of the requested item or the default value if the item does not exist.
es: Un registro Rapido contiene **elementos**. El método ``get(item, default=none)`` devuelve el valor del elemento solicitado o el valor predeterminado si el elemento no existe.

source: Displaying the votes
es: Mostrando los votos

source: Now we are able to store votes, we also want to display the *total* of votes.
es: Ahora somos capaces de almacenar votos, también queremos mostrar el *total* de votos.

source: Fist, let's change the block layout in ``rate.html``:
es: Primero, vamos a cambiar el diseño del bloque en el archivo ``rate.html``:

source: So now we have a new ``display`` element in our block.
es: Así que ahora tenemos un nuevo elemento ``display`` en nuestro bloque.

source: We must declare it in ``rate.yaml``:
es: Debemos declararlo en el archivo ``rate.yaml``:

source: And let's implement it in ``rate.py``:
es: Y vamos a implementarlo en el archivo ``rate.py``:

source: We get the record corresponding to the current content, and we return as many ❤ as votes we have stored.
es: Obtenemos el registro correspondiente al contenido actual, y devolvemos tantos símbolos de ❤ como votos que hemos almacenado.

source: That's it! Our rating feature is ready to be used.
es: ¡Eso es! Nuestra función de clasificación está lista para ser utilizada.

source: Debugging
es: Depuración

source: As we are writing code, we might (we will) make mistakes. In this case, , it is always helpful to read the error messages returned by the system.
es: Como estamos escribiendo código, nosotros podríamos (vamos a) cometer errores. En este caso, siempre es útil leer los mensajes de error devueltos por el sistema.

source: It is also very helpful to be able to log messages from our code, so we understand what is going on exactly when it is executed.
es: También es muy útil poder registrar mensajes de nuestro código, asi entendemos lo que está sucediendo exactamente cuando se ejecuta.

source: Rapido provides the ``context.app.log()`` method which will log string messages or any serializable object (dictionnaries, arrays, etc.).
es: Rapido provee el método ``context.app.log()`` que registrará mensajes de cadena o cualquier objeto serializable (diccionarios, arreglos, etc.).

source: The log messages and the error messages are visible in the server log (but we might not be able to access it), but also in our browser's **javascript console**.
es: Los mensajes de registro y los mensajes de error están visibles en el registro del servidor (pero es posible que no podamos acceder a él), sino también en la **consola javascript** de nuestro navegador.

source: First thing to do is to enable the **debug mode** in our app. To do that, we need to create a ``settings.yaml`` file in ``/rapido/rating``:
es: Lo primero que debemos hacer es activar el **modo de depuración** en nuestra aplicación. Para ello, necesitamos crear un archivo ``settings.yaml`` dentro de la carpeta ``/rapido/rating``:

source: And now, let's change our ``display`` function:
es: Y ahora, cambiemos nuestra función ``display``:

source: We will see the following in our browser's console:
es: Veremos lo siguiente en la consola de nuestro navegador:

source: Let's imagine now we made an error like forgetting the colon at the end of the ``if`` statement:
es: Imaginemos ahora que cometimos un error como olvidar el carácter ``:`` al final de la sentencia ``if``:

source: Then we get this:
es: Entonces tenemos esto en la consola:

source: Listing the top 5 items
es: Listado de los 5 elementos mas votados

source: We would also like to see the top 5 rated content items on the site home page.
es: También nos gustaría ver los 5 elementos de contenido más votados en la página principal del sitio.

source: The first thing we need is to index the ``total`` element.
es: Lo primero que necesitamos es indexar el elemento ``total``.

source: We declare its indexing mode in ``rate.yaml``:
es: Declaramos ese modo índice en el archivo ``rate.yaml``:

source: To index the previously stored values, we have to refresh the storage index by calling the following URL:
es: Para indexar los valores almacenados previamente, debemos actualizar el índice de almacenamiento llamando a la siguiente dirección URL:

source: And to make sure future changes will be indexed, we need to fix the ``like`` function in the ``rate`` block: the indexing is triggered when we call the record's ``save`` method:
es: Y para asegurarnos de que los cambios futuros serán indexados, necesitamos arreglar la función ``like`` en el bloque ``rate``: la indexación se dispara cuando llamamos al método ``save`` del registro:

source: We are now able to build a block to display the top 5 contents:
es: Ahora podemos crear un bloque para mostrar los 5 contenidos mas votados:

source: ``top5.html``:
es: el archivo ``top5.html``:

source: ``top5.yaml``:
es: el archivo ``top5.yaml``:

source: ``top5.py``:
es: el archivo ``top5.py``:

source: The ``search`` method allows us to query our stored records. The record ids are the content paths, so using the Plone API (``context.api``), we can easily get the corresponding contents, and then obtain their URLs and titles.
es: El método ``search`` nos permite consultar nuestros registros almacenados. Los identificadores de registro son las rutas de contenido, por lo que usando API de Plone (``context.api``), podemos obtener fácilmente el contenido correspondiente y luego obtener sus direcciones URL y títulos.

source: Our block works now:
es: Nuestro bloque funciona ahora en la siguiente dirección URL:

source: Finally, we have to insert our block in the home page. That will be done in ``rules.xml``:
es: Finalmente, tenemos que insertar nuestro bloque en la página de inicio. Eso se hará en ``rules.xml``:

source: Creating a new page for reports
es: Creación de una nueva página para reportes

source: For now, we have just added small chunks of HTML in existing pages. But Rapido also allows us to create a new page (a Plone developer would name it a new `view`).
es: Por ahora, acabamos de añadir trozos pequeños de HTML en las páginas existentes. Pero Rapido también nos permite crear una nueva página (un desarrollador de Plone la nombraría una nueva `view` o vista).

source: Let's pretend we want to create a report page about the votes on the content of a folder.
es: Supongamos que queremos crear una página de reportes sobre los votos sobre el contenido de una carpeta.

source: First, we need a block, ``report.html``:
es: Primero, necesitamos un bloque, el archivo llamado ``report.html``:

source: We want this block to be the main content of a new view.
es: Queremos que este bloque sea el contenido principal de una nueva vista.

source: We need to declare it in a new YAML file called ``report.yaml``:
es: Necesitamos declarar en un nuevo archivo YAML llamado ``report.yaml``:

source: Now if we visit for instance:
es: Ahora si visitamos por ejemplo:

source: we do see our block as main page content.
es: vemos nuestro bloque como contenido de la página principal.

source: Now we need to implement our report content. We could do it with a Rapido element like we did in the Top 5 block.
es: Ahora necesitamos implementar nuestro contenido de reporte. Podríamos hacerlo con un elemento Rapido como lo hicimos en el bloque Top 5.

source: Let's change our approach and implement a fancy pie chart using the `amazing D3js library <http://d3js.org/>`_ and the :doc:`Rapido REST API <./rest>`.
es: Vamos a cambiar nuestro enfoque e implementar una gráfico de pastel bonita utilizando la `increíble librería D3js <http://d3js.org/>`_ y la :doc:`API REST de Rapido <./rest>`.

source: We need to create a Javascript file (``report.js``) in the ``/rapido/rating`` folder:
es: Necesitamos crear un archivo Javascript (``report.js``) en la carpeta ``/rapido/rating``:

source: That is quite a complex script, and we will not detail here the D3js-related aspects (it is just a typical example to draw a pie chart); we will focus on the way we obtain the data.
es: Ese es un script bastante complejo, y no detallaremos aquí los aspectos relacionados con D3js (es sólo un ejemplo típico para dibujar un gráfico circular tipo pastel); Nos centraremos en la forma en que obtenemos los datos.

source: The first thing to notice is the ``require`` function. It is a feature of the RequireJS library (provided with Plone by default) to load our dependencies.
es: Lo primero que debe notar es la función ``require``. Es una característica de la librería RequireJS (provista con Plone por defecto) para cargar nuestras dependencias.

source: We have 2 dependencies:
es: Tenemos 2 dependencias:

source: ``mockup-utils``, which is a Plone internal resource,
es: ``mockup-utils``, que es un recurso interno de Plone,

source: D3js (and we load it by passing its remote URL to RequireJS).
es: La librería D3js (y lo cargamos pasando su URL remota a RequireJS).

source: ``mockup-utils`` allows us to get the authenticator token (with the ``getAuthenticator`` method), we need it to use the Rapido REST API.
es: ``mockup-utils`` nos permite obtener el token de autenticador (con el método ``getAuthenticator``), lo necesitamos para usar la API REST de Rapido.

source: RequireJS or ``mockup-utils`` are not mandatory to use the Rapido REST API, if we were outside of Plone (using Rapido as a remote backend), we would have made a call to ``../@@rapido/rating`` which returns the token in an HTTP header. We just use them because they are provided by Plone by default, and they make our work easier.
es: RequireJS o ``mockup-utils`` no son obligatorios para usar el API REST de Rapido, si estuviéramos fuera de Plone (utilizando Rapido como backend remoto), nosotros deberíamos hacer una llamada a ``../@@rapido/rating`` que devuelve el token en una cabecera HTTP. Solo los utilizamos porque son proporcionados por Plone por defecto, y facilitan nuestro trabajo.

source: Instead of loading D3 directly form its CDN, we could have put the ``d3.v3.min.js`` in the ``/rapido/rating`` folder, and serve it locally.
es: En vez de la forma de cargar directamente D3 desde su CDN, podríamos haber puesto el archivo ``d3.v3.min.js`` en la carpeta ``/rapido/rating``, y servirlo localmente.

source: The second interesting part is the ``d3.json()`` call:
es: La segunda parte interesante es la llamada al metodo ``d3.json()``:

source: it calls the ``@@rapido/rating/search`` endpoint,
es: ese llama al endpoint ``@@rapido/rating/search``,

source: it puts the authenticator token in the ``X-Csrf-Token`` header,
es: ese pone el token de autenticador en el encabezado ``X-Csrf-Token``,

source: and it passes the search query in the request BODY.
es: y pasa la consulta de búsqueda en la solicitud BODY.

source: That is basically what we need to do whatever JS framework we use (here we use D3, but it could be a generalist framework like Angular, Backbone, Ember, etc.).
es: Eso es básicamente lo que necesitamos hacer en cualquier framework JS que usamos (aquí usamos D3, pero podría ser un framework generalista como Angular, Backbone, Ember, etc.).

source: Now we just need to load this script from our block:
es: Ahora sólo necesitamos cargar este script desde nuestro bloque:

source: And we can visit:
es: Y podemos visitarlo en la siguiente dirección URL:

source: to see a pie chart about votes on the *News* items!!
es: para ver un gráfico circular de pastel de los votos en todos los tipos de contenido *Noticias* en la sección del sitio llamada *News*!!!

source: Download the :download:`source files of this tutorial <files/tutorial.zip>`.
es: Descargue los :download:`códigos fuentes de este tutorial <files/tutorial.zip>`.

source: This .zip file can be imported in the theming editor, but it cannot be activated as a regular theme as it just contains our Rapido app. The app can be used from our main theme by adding a `rating.lnk` file in our current theme's ``rapido`` folder, containing::
es: Este archivo .zip se puede importar en el editor de temas, pero no se puede activar como un tema regular, ya que sólo contiene nuestra aplicación Rapido. La aplicación puede utilizarse desde nuestro tema principal añadiendo un archivo `rating.lnk` en la carpeta ``rapido`` nuestro tema actual, que contiene::

source: indicating the Rapido app named ``rating`` is stored in the theme named ``tutorial``. And then we can activate our specific rules by adding:
es: indicando que la aplicación Rapido denominada ``rating`` se almacena en el tema denominado ``tutorial``. Y luego podemos activar nuestras reglas específicas añadiendo:

source: in our main theme's ``rules.xml``.
es: en nuestro principal archivo ``rules.xml`` del tema Diazo.
